app/controllers/admin_controller.rb

    def index

        @user_count = User.all.where("id != ?", current_user.id)
        if params[:username] || params[:time_type] || params[:start_date] || params[:end_date]
            param = give_me_filter_params
            @all_users = nil
            q = nil

            if param['group_by']
                if param['group_by'] == 'monthly'
                    q = 'created_at BETWEEN ? AND ?', DateTime.now.beginning_of_month, DateTime.now.end_of_month
                else
                    q = 'created_at BETWEEN ? AND ?', DateTime.now.beginning_of_week, DateTime.now.end_of_week
                end
            end


            if  param['username'] && param['time_type'] && param['start_date'] && param['end_date']
                @user = User.lower_username(param['username'].downcase)

                start_date = Date.strptime(param['start_date'], "%Y-%m-%d")
                end_date = Date.strptime(param['end_date'],"%Y-%m-%d")

                @all_users = TimeRecord.where(start_date: start_date.beginning_of_day..end_date.end_of_day, user_id:@user,
                time_type:param['time_type'])
                .paginate(:page => params[:page], :per_page => 5)

            elsif param['username'] && param['time_type'] && param['group_by'] && @all_user.blank?
                @user = User.lower_username(param['username'].downcase)

                @all_users = TimeRecord.where(q).where(time_type:param['time_type'], user_id:@user)
                .paginate(:page => params[:page], :per_page => 5)

            elsif param['time_type'] && param['group_by'] && @all_users.blank?

                @all_users = TimeRecord.where(q).where(time_type:param['time_type'])
                .paginate(:page => params[:page], :per_page => 5)
---
SELECT COUNT(*) FROM "users" WHERE "users"."id" != $1  [["id", 3]]
SELECT "users".* FROM "users" WHERE (username like ''hanif'%' ) ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT "time_records".* FROM "time_records" WHERE "time_records"."start_date" BETWEEN $1 AND $2 AND "time_records"."user_id" IN (SELECT "users"."id" FROM "users" WHERE (lower(username) like '%vitae%')) AND "time_records"."time_type" = $3 LIMIT $4 OFFSET $5  [["start_date", "2022-11-25 02:00:00"], ["start_date", "2022-11-26 01:59:59.999999"], ["time_type", "bug"], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "time_records" WHERE "time_records"."user_id" IN (SELECT "users"."id" FROM "users" WHERE (lower(username) like '%can%')) AND "time_records"."start_date" BETWEEN $1 AND $2  [["start_date", "2022-11-30 03:00:00"], ["start_date", "2022-12-03 02:59:59.999999"]]
SELECT "time_records".* FROM "time_records" WHERE (created_at BETWEEN '2022-11-21 00:00:00' AND '2022-11-27 23:59:59.999999') AND "time_records"."time_type" = $1 AND "time_records"."user_id" IN (SELECT "users"."id" FROM "users" WHERE (lower(username) like '%vitae%')) LIMIT $2 OFFSET $3  [["time_type", "bug"], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "time_records" WHERE "time_records"."user_id" IN (SELECT "users"."id" FROM "users" WHERE (lower(username) like '%can%')) AND "time_records"."time_type" = $1  [["time_type", "bug"]]
SELECT COUNT(*) FROM "time_records" WHERE (start_date BETWEEN '2022-11-28 00:00:00' AND '2022-12-04 23:59:59.999999') AND "time_records"."time_type" = $1  [["time_type", "issue"]]

            elsif param['username'] && param['group_by'] && @all_users.blank?
                @user = User.lower_username(param['username'].downcase)

                @all_users = TimeRecord.where(q).where(user_id:@user)
                .paginate(:page => params[:page], :per_page => 5)
---
SELECT "time_records".* FROM "time_records" WHERE (created_at BETWEEN '2022-11-21 00:00:00' AND '2022-11-27 23:59:59.999999') AND "time_records"."user_id" IN (SELECT "users"."id" FROM "users" WHERE (lower(username) like '%vitae%')) LIMIT $1 OFFSET $2  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "time_records" WHERE "time_records"."user_id" IN (SELECT "users"."id" FROM "users" WHERE (lower(username) like '%vita%'))

                start_date = Date.strptime(param['start_date'], "%Y-%m-%d")
                end_date = Date.strptime(param['end_date'],"%Y-%m-%d")

                @all_users = TimeRecord.where(start_date: start_date.beginning_of_day..end_date.end_of_day, user_id:@user)
                .paginate(:page => params[:page], :per_page => 5)
---
SELECT COUNT(*) FROM "time_records" WHERE "time_records"."start_date" BETWEEN $1 AND $2  [["start_date", "2022-11-30 03:00:00"], ["start_date", "2022-12-02 02:59:59.999999"]]

                start_date = Date.strptime(param['start_date'], "%Y-%m-%d")
                end_date = Date.strptime(param['end_date'],"%Y-%m-%d")

                @all_users = TimeRecord.where(start_date: start_date.beginning_of_day..end_date.end_of_day, time_type: param['time_type'])
                .paginate(:page => params[:page], :per_page => 5)
---
SELECT COUNT(*) FROM "time_records" WHERE "time_records"."start_date" BETWEEN $1 AND $2 AND "time_records"."time_type" = $3  [["start_date", "2022-11-29 03:00:00"], ["start_date", "2022-12-03 02:59:59.999999"], ["time_type", "issue"]]

                start_date = Date.strptime(param['start_date'], "%Y-%m-%d")
                end_date = Date.strptime(param['end_date'],"%Y-%m-%d")

                @all_users = TimeRecord.where(start_date: start_date.beginning_of_day..end_date.end_of_day)
                .paginate(:page => params[:page], :per_page => 5)

            elsif param['time_type'] && param['username'] && @all_users.blank?
                @user = User.lower_username(param['username'].downcase)
                @all_users = TimeRecord.where(user_id: @user, time_type: params[:time_type] ).paginate(:page => params[:page], :per_page => 5)


            elsif param['time_type'] && @all_user.blank?
                @all_users = TimeRecord.where(time_type: params[:time_type] ).order(start_date: :desc)
                .paginate(:page => params[:page], :per_page => 5)
---
SELECT COUNT(*) FROM "time_records" WHERE (start_date BETWEEN '2022-12-01 00:00:00' AND '2022-12-31 23:59:59.999999')
SELECT COUNT(*) FROM "time_records" WHERE "time_records"."user_id" IN (SELECT "users"."id" FROM "users" WHERE (lower(username) like '%can%'))
SELECT COUNT(*) FROM "time_records" WHERE "time_records"."time_type" = $1  [["time_type", "issue"]]


            elsif param['group_by'] && @all_users.blank?

                @all_users = TimeRecord.where(q).order(start_date: :desc)
                .paginate(:page => params[:page], :per_page => 5)

            else
                @all_users = TimeRecord.all.order(start_date: :desc).paginate(:page => params[:page], :per_page => 5)
---
SELECT COUNT(*) FROM "time_records" WHERE (created_at BETWEEN '2022-11-21 00:00:00' AND '2022-11-27 23:59:59.999999')
SELECT "time_records".* FROM "time_records" ORDER BY "time_records"."start_date" DESC LIMIT $1 OFFSET $2  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "time_records"