app/controllers/home_controller.rb

    def create
        @timerecord = current_user.time_records.create(timerecord_params)

        if @timerecord.save
---
INSERT INTO "time_records" ("comment", "time_type", "start_date", "end_date", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
INSERT INTO "time_records" ("comment", "time_type", "start_date", "end_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

    def destroy
        @timerecord = current_user.time_records.delete(params[:id])
---
DELETE FROM "time_records" WHERE "time_records"."id" = $1  [["id", 7]]

    def new
        begin

            @user = current_user
            @timerecord = TimeRecord.new
            @user_time_records = User.find(current_user.id).time_records
---
SELECT "time_records".* FROM "time_records" WHERE "time_records"."user_id" = $1 AND "time_records"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 14], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def update
        @timerecord = current_user.time_records.find(params[:id]).update(end_date: Time.now)
---
SELECT "time_records".* FROM "time_records" WHERE "time_records"."user_id" = $1 AND "time_records"."id" = $2 LIMIT $3  [["user_id", 6], ["id", 31], ["LIMIT", 1]]
UPDATE "time_records" SET "end_date" = $1, "updated_at" = $2 WHERE "time_records"."id" = $3  [["end_date", "2022-11-28 18:25:56.974482"], ["updated_at", "2022-11-28 18:25:56.974941"], ["id", 31]]

    def show
        begin
            @user = current_user
            @timerecord = @user.time_records.find(params[:id])
        rescue
            @timerecord = TimeRecord.find(params[:id])
---
SELECT "time_records".* FROM "time_records" WHERE "time_records"."user_id" = $1 AND "time_records"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 4], ["LIMIT", 1]]
SELECT "time_records".* FROM "time_records" WHERE "time_records"."id" = $1 LIMIT $2  [["id", 31], ["LIMIT", 1]]