app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "hanifi@gmail.com"], ["LIMIT", 1]]
---
    def create
        begin
            @user = User.find_by(email: params[:user][:email].downcase)