app/controllers/user_controller.rb

INSERT INTO "users" ("email", "username", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["email", "can@gmail.com"], ["username", "cann"], ["password", "[FILTERED]"], ["created_at", "2022-11-21 14:04:48.937777"], ["updated_at", "2022-11-21 14:04:48.937777"]]
---
    def create
        @user = User.new(user_params)

        if @user.save