app/controllers/concerns/authentication.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def current_user
      Current.user ||= session[:current_user_id] && User.find_by(id: session[:current_user_id])